[bit9:carbonblack:json]
SHOULD_LINEMERGE = false
KV_MODE = JSON
TIME_PREFIX = \"timestamp\"\:
TIME_FORMAT=%s
MAX_TIMESTAMP_LOOKAHEAD = 0
pulldown_type = true


##############################################################
## General
##############################################################
REPORT-event_type 	  = carbonblack_is_alert_transform
REPORT-operation_type = carbonblack_is_network_transform, carbonblack_is_file_transform, carbonblack_is_registry_transform, carbonblack_is_process_transform, carbonblack_is_binary_transform

REPORT-endpoint = carbonblack_endpoint_transform, carbonblack_endpoint_transform2

EVAL-dvc 			= COALESCE(endpoint, hostname, computer_name)
EVAL-vendor 		= "Bit9"
EVAL-product 		= "Carbon Black"
EVAL-vendor_product = "Bit9 Carbon Black"
EVAL-status         = if(status=="Unresolved","success",status)
EVAL-dest_nt_domain = if(mvcount(split(username,"\\"))==2,mvindex(split(username,"\\"),0),null)
EVAL-user			= COALESCE(mvindex(split(username,"\\"),-1),"process-guid:"+process_guid)
##############################################################
## ALERTS CIM
##############################################################
FIELDALIAS-app		= docs{}.product_name as app
FIELDALIAS-body		= ioc_attr as body

FIELDALIAS-notification_type = type as notification_type
EVAL-type = if(is_alert!="" OR alert_type!="","alert",type)

EVAL-subject = "Type:"+notification_type + ", Watchlist_name:" + watchlist_name
EVAL-severity = if(is_alert !="" OR alert_type!="",if(alert_severity < 20, "informational", if((alert_severity >= 20 AND alert_severity < 40), "low", if((alert_severity >= 40 AND alert_severity < 60), "medium", if((alert_severity >= 60 AND alert_severity < 80), "high", if((alert_severity >= 80), "critical", "unknown"))))),null)


##############################################################
## CHANGE ANALYSIS CIM
##############################################################
REPORT-object_info = carbonblack_file_and_path_transform, carbonblack_registry_transform

FIELDALIAS-size = docs{}.orig_mod_len as size
EVAL-file_size = size/1024

EVAL-change_type = if((is_file != "" OR is_binary != ""),"filesystem", if(is_registry != "", "registry", if(is_process != "", "process", "")))

EVAL-file_name = if(is_file != "", file_name, null)
EVAL-file_path = if(is_file != "", file_path, null)

EVAL-registry_path = if(is_registry != "", COALESCE(registry_path,file_path),null)
EVAL-registry_key = if(is_registry != "", COALESCE(registry_key,file_name),null)
EVAL-registry_value = if(is_registry != "",registry_value,null)

EVAL-object = case(is_file!="",file_name,is_registry!="", COALESCE(registry_key,file_name))
EVAL-object_path = case(is_file!="",file_path,is_registry!="",COALESCE(registry_path,file_path))


FIELDALIAS-vendor_action = action as vendor_action
LOOKUP-bit9_cbs_actions_lookup = bit9_cbs_actions_lookup vendor_action OUTPUTNEW action

##############################################################
## APPLICATION STATE CIM
##############################################################
FIELDALIAS-process_id = pid as process_id
EVAL-process = if(file_name!="0", file_name, null)

##############################################################
## NETWORK TRAFFIC CIM
##############################################################

EVAL-dest_ip = COALESCE(ipv4,comms_ip)
FIELDALIAS-dest_translated_ip = ipv4 as dest_translated_ip
EVAL-dest = if(domain!="",domain,COALESCE(ipv4, endpoint, server_name, computer_name))
EVAL-src  = COALESCE(hostname, computer_name)
EVAL-dest_port = if(direction == "outbound",port,null)
EVAL-src_port = if(direction == "inbound",port,null)
EVAL-dest_translated_port = if(direction == "outbound",port,null)
EVAL-src_translated_port = if(direction == "inbound",port,null)
EVAL-transport = if(protocol=="6","tcp",if(protocol=="17","udp","unknown"))
EVAL-protocol = if(is_network=="netconn","ip",null)

##############################################################
## IDS CIM
##############################################################
EVAL-action = if(is_network=="netconn" OR (is_alert!="" OR alert_type!="") AND (isnull(is_file) AND isnull(is_registry) AND isnull(is_binary)),"allowed",null)
EVAL-category = if(is_alert!="" OR alert_type!="",coalesce(watchlist_name,report_id),null)
EVAL-signature = if(is_alert!="" OR alert_type!="",type,null)
EVAL-ids_type = if(is_alert!="" OR alert_type!="","host",null)